#include "prophet_card.h"

#if 0

FTCARD prophet_cards_ua[] = { 
	
	{ 1, UP, { "аегоепевмн", "", "", "" } },
	{ 2, DN, { "рюй", "╡ асде", "","" } },
	{ 2, DN, { "фндмху", "яслм╡б╡б", "", "" } },
	{ 2, UP, { "аегслнбмн", "рюй", "", "" } },
	{ 1, UP, { "б╡дасдерэяъ", "", "", "" } },

	{ 2, UP, { "гдю╙рэяъ", "рюй", "", "" } },
	{ 3, UP, { "яйнп╡ье", "гю бяе", "рюй", "" } },
	{ 2, UP, { "оепяоейрхбх", "днап╡", "", "" } },
	{ 1, UP, { "рюй", "", "", "" } },
	{ 3, UP, { "гнп╡", "йюфсрэ", "рюй", "" } },

	{ 3, UP, { "ме лнфс", "б╡донб╡ярх", "гюпюг", "" } },
	{ 2, DN, { "яохрюи", "о╡гм╡ье" } },
	{ 2, DN, { "мюпюг╡", "меб╡днлн", "", "" } },
	{ 3, DN, { "гюпюг", "оепедавхрх", "мелнфкхбн", "" } },
	{ 2, UP, { "гюохрюире", "рнвм╡ье", "", "" } },

	{ 3, UP, { "мюб╡рэ", "ме", "дслюи", "" } },
	{ 3, UP, { "лнъ", "б╡донб╡дэ", "м╡", "" } },
	{ 1, UP, { "м╡", "", "", ""  } },
	{ 3, UP, { "оепяоейрхбх", "онцюм╡", "", "" } },
	{ 2, DN, { "бекэлх", "яслм╡бмн", "", "" } },
	
	{ 1, UP, { "ERROR", "", "", "" } },

};
		
#else 


FTCARD prophet_cards_ua[] = { 
	
	
	{ 2, UP, { "рнвмн", "рюй", "", "" } },
	{ 2, DN, { "аег", "яслм╡б╡б", "", "" } },
	

	{ 2, UP, { "гдю╙рэяъ", "рюй", "", "" } },
	{ 1, UP, { "рюй", "", "", "" } },
	{ 1, UP, { "лнфкхбн", "", "", "" } },
	{ 2, DN, { "дслюч", "ын рюй", "", "" } },
	{ 3, UP, { "дсух", "цнбнпърэ", "рюй", "" } },
	{ 2, DN, { "дсфе", "илнб╡пмн", "", "" } },
	{ 2, DN, { "ьюмях", "унпнь╡", "", "" } },

		
    { 1, UP, { "мегпнгсл╡кн", "", "", "" } },
	{ 1, UP, { "ялсрмн", "", "", "" } },
	{ 3, DN, { "ме", "лнфс", "яйюгюрх", "" } },
	{ 2, DN, { "╙", "яслм╡бх", "", "" } },
	{ 2, DN, { "ме", "гюпюг", "", "" } },
	{ 2, UP, { "гюохрюи", "о╡гм╡ье", "", "" } },
	{ 2, UP, { "гюохрюире", "гмнбс", "", "" } },
	
	
	{ 3, UP, { "дсух", "цнбнпърэ", "м╡", "" } },
	{ 3, UP, { "дслюч", "ын", "м╡", "" } },
	{ 1, UP, { "м╡", "", "", "" } },
	{ 2, UP, { "ьюмя╡б", "люкн", "", "" } },
	
	
	
	{ 1, UP, { "ERROR", "", "", "" } },

};


#endif









const unsigned int prophet_cards_ua_size = sizeof(prophet_cards_ua) / sizeof(FTCARD);
